virtualabs/cutcutgo/src/packs/ATSAMA5D27CLD2G_DFP/component/qspi.h
/* -------- QSPI_IER : (QSPI Offset: 0x14) ( /W 32) Interrupt Enable Register -------- */
#define QSPI_IER_RDRF_Pos                     _U_(0)                                               /**< (QSPI_IER) Receive Data Register Full Interrupt Enable Position */
#define QSPI_IER_RDRF_Msk                     (_U_(0x1) << QSPI_IER_RDRF_Pos)                      /**< (QSPI_IER) Receive Data Register Full Interrupt Enable Mask */
#define QSPI_IER_RDRF(value)                  (QSPI_IER_RDRF_Msk & ((value) << QSPI_IER_RDRF_Pos))
#define QSPI_IER_TDRE_Pos                     _U_(1)                                               /**< (QSPI_IER) Transmit Data Register Empty Interrupt Enable Position */
#define QSPI_IER_TDRE_Msk                     (_U_(0x1) << QSPI_IER_TDRE_Pos)                      /**< (QSPI_IER) Transmit Data Register Empty Interrupt Enable Mask */
#define QSPI_IER_TDRE(value)                  (QSPI_IER_TDRE_Msk & ((value) << QSPI_IER_TDRE_Pos))
#define QSPI_IER_TXEMPTY_Pos                  _U_(2)                                               /**< (QSPI_IER) Transmission Registers Empty Enable Position */
#define QSPI_IER_TXEMPTY_Msk                  (_U_(0x1) << QSPI_IER_TXEMPTY_Pos)                   /**< (QSPI_IER) Transmission Registers Empty Enable Mask */
#define QSPI_IER_TXEMPTY(value)               (QSPI_IER_TXEMPTY_Msk & ((value) << QSPI_IER_TXEMPTY_Pos))
#define QSPI_IER_OVRES_Pos                    _U_(3)                                               /**< (QSPI_IER) Overrun Error Interrupt Enable Position */
#define QSPI_IER_OVRES_Msk                    (_U_(0x1) << QSPI_IER_OVRES_Pos)                     /**< (QSPI_IER) Overrun Error Interrupt Enable Mask */
#define QSPI_IER_OVRES(value)                 (QSPI_IER_OVRES_Msk & ((value) << QSPI_IER_OVRES_Pos))
#define QSPI_IER_CSR_Pos                      _U_(8)                                               /**< (QSPI_IER) Chip Select Rise Interrupt Enable Position */
#define QSPI_IER_CSR_Msk                      (_U_(0x1) << QSPI_IER_CSR_Pos)                       /**< (QSPI_IER) Chip Select Rise Interrupt Enable Mask */
#define QSPI_IER_CSR(value)                   (QSPI_IER_CSR_Msk & ((value) << QSPI_IER_CSR_Pos))  
#define QSPI_IER_CSS_Pos                      _U_(9)                                               /**< (QSPI_IER) Chip Select Status Interrupt Enable Position */
#define QSPI_IER_CSS_Msk                      (_U_(0x1) << QSPI_IER_CSS_Pos)                       /**< (QSPI_IER) Chip Select Status Interrupt Enable Mask */
#define QSPI_IER_CSS(value)                   (QSPI_IER_CSS_Msk & ((value) << QSPI_IER_CSS_Pos))  
#define QSPI_IER_INSTRE_Pos                   _U_(10)                                              /**< (QSPI_IER) Instruction End Interrupt Enable Position */
#define QSPI_IER_INSTRE_Msk                   (_U_(0x1) << QSPI_IER_INSTRE_Pos)                    /**< (QSPI_IER) Instruction End Interrupt Enable Mask */
#define QSPI_IER_INSTRE(value)                (QSPI_IER_INSTRE_Msk & ((value) << QSPI_IER_INSTRE_Pos))
#define QSPI_IER_Msk                          _U_(0x0000070F)                                      /**< (QSPI_IER) Register Mask  */


/* -------- QSPI_IDR : (QSPI Offset: 0x18) ( /W 32) Interrupt Disable Register -------- */
#define QSPI_IDR_RDRF_Pos                     _U_(0)                                               /**< (QSPI_IDR) Receive Data Register Full Interrupt Disable Position */
#define QSPI_IDR_RDRF_Msk                     (_U_(0x1) << QSPI_IDR_RDRF_Pos)                      /**< (QSPI_IDR) Receive Data Register Full Interrupt Disable Mask */
#define QSPI_IDR_RDRF(value)                  (QSPI_IDR_RDRF_Msk & ((value) << QSPI_IDR_RDRF_Pos))
#define QSPI_IDR_TDRE_Pos                     _U_(1)                                               /**< (QSPI_IDR) Transmit Data Register Empty Interrupt Disable Position */
#define QSPI_IDR_TDRE_Msk                     (_U_(0x1) << QSPI_IDR_TDRE_Pos)                      /**< (QSPI_IDR) Transmit Data Register Empty Interrupt Disable Mask */
#define QSPI_IDR_TDRE(value)                  (QSPI_IDR_TDRE_Msk & ((value) << QSPI_IDR_TDRE_Pos))
#define QSPI_IDR_TXEMPTY_Pos                  _U_(2)                                               /**< (QSPI_IDR) Transmission Registers Empty Disable Position */
#define QSPI_IDR_TXEMPTY_Msk                  (_U_(0x1) << QSPI_IDR_TXEMPTY_Pos)                   /**< (QSPI_IDR) Transmission Registers Empty Disable Mask */
#define QSPI_IDR_TXEMPTY(value)               (QSPI_IDR_TXEMPTY_Msk & ((value) << QSPI_IDR_TXEMPTY_Pos))
#define QSPI_IDR_OVRES_Pos                    _U_(3)                                               /**< (QSPI_IDR) Overrun Error Interrupt Disable Position */
#define QSPI_IDR_OVRES_Msk                    (_U_(0x1) << QSPI_IDR_OVRES_Pos)                     /**< (QSPI_IDR) Overrun Error Interrupt Disable Mask */
#define QSPI_IDR_OVRES(value)                 (QSPI_IDR_OVRES_Msk & ((value) << QSPI_IDR_OVRES_Pos))
#define QSPI_IDR_CSR_Pos                      _U_(8)                                               /**< (QSPI_IDR) Chip Select Rise Interrupt Disable Position */
#define QSPI_IDR_CSR_Msk                      (_U_(0x1) << QSPI_IDR_CSR_Pos)                       /**< (QSPI_IDR) Chip Select Rise Interrupt Disable Mask */
#define QSPI_IDR_CSR(value)                   (QSPI_IDR_CSR_Msk & ((value) << QSPI_IDR_CSR_Pos))  
#define QSPI_IDR_CSS_Pos                      _U_(9)                                               /**< (QSPI_IDR) Chip Select Status Interrupt Disable Position */
#define QSPI_IDR_CSS_Msk                      (_U_(0x1) << QSPI_IDR_CSS_Pos)                       /**< (QSPI_IDR) Chip Select Status Interrupt Disable Mask */
#define QSPI_IDR_CSS(value)                   (QSPI_IDR_CSS_Msk & ((value) << QSPI_IDR_CSS_Pos))  
#define QSPI_IDR_INSTRE_Pos                   _U_(10)                                              /**< (QSPI_IDR) Instruction End Interrupt Disable Position */
#define QSPI_IDR_INSTRE_Msk                   (_U_(0x1) << QSPI_IDR_INSTRE_Pos)                    /**< (QSPI_IDR) Instruction End Interrupt Disable Mask */
#define QSPI_IDR_INSTRE(value)                (QSPI_IDR_INSTRE_Msk & ((value) << QSPI_IDR_INSTRE_Pos))
#define QSPI_IDR_Msk                          _U_(0x0000070F)                                      /**< (QSPI_IDR) Register Mask  */


/* -------- QSPI_IMR : (QSPI Offset: 0x1C) ( R/ 32) Interrupt Mask Register -------- */
#define QSPI_IMR_RDRF_Pos                     _U_(0)                                               /**< (QSPI_IMR) Receive Data Register Full Interrupt Mask Position */
#define QSPI_IMR_RDRF_Msk                     (_U_(0x1) << QSPI_IMR_RDRF_Pos)                      /**< (QSPI_IMR) Receive Data Register Full Interrupt Mask Mask */
#define QSPI_IMR_RDRF(value)                  (QSPI_IMR_RDRF_Msk & ((value) << QSPI_IMR_RDRF_Pos))
#define QSPI_IMR_TDRE_Pos                     _U_(1)                                               /**< (QSPI_IMR) Transmit Data Register Empty Interrupt Mask Position */
#define QSPI_IMR_TDRE_Msk                     (_U_(0x1) << QSPI_IMR_TDRE_Pos)                      /**< (QSPI_IMR) Transmit Data Register Empty Interrupt Mask Mask */
#define QSPI_IMR_TDRE(value)                  (QSPI_IMR_TDRE_Msk & ((value) << QSPI_IMR_TDRE_Pos))
#define QSPI_IMR_TXEMPTY_Pos                  _U_(2)                                               /**< (QSPI_IMR) Transmission Registers Empty Mask Position */
#define QSPI_IMR_TXEMPTY_Msk                  (_U_(0x1) << QSPI_IMR_TXEMPTY_Pos)                   /**< (QSPI_IMR) Transmission Registers Empty Mask Mask */
#define QSPI_IMR_TXEMPTY(value)               (QSPI_IMR_TXEMPTY_Msk & ((value) << QSPI_IMR_TXEMPTY_Pos))
#define QSPI_IMR_OVRES_Pos                    _U_(3)                                               /**< (QSPI_IMR) Overrun Error Interrupt Mask Position */
#define QSPI_IMR_OVRES_Msk                    (_U_(0x1) << QSPI_IMR_OVRES_Pos)                     /**< (QSPI_IMR) Overrun Error Interrupt Mask Mask */
#define QSPI_IMR_OVRES(value)                 (QSPI_IMR_OVRES_Msk & ((value) << QSPI_IMR_OVRES_Pos))
#define QSPI_IMR_CSR_Pos                      _U_(8)                                               /**< (QSPI_IMR) Chip Select Rise Interrupt Mask Position */
#define QSPI_IMR_CSR_Msk                      (_U_(0x1) << QSPI_IMR_CSR_Pos)                       /**< (QSPI_IMR) Chip Select Rise Interrupt Mask Mask */
#define QSPI_IMR_CSR(value)                   (QSPI_IMR_CSR_Msk & ((value) << QSPI_IMR_CSR_Pos))  
#define QSPI_IMR_CSS_Pos                      _U_(9)                                               /**< (QSPI_IMR) Chip Select Status Interrupt Mask Position */
#define QSPI_IMR_CSS_Msk                      (_U_(0x1) << QSPI_IMR_CSS_Pos)                       /**< (QSPI_IMR) Chip Select Status Interrupt Mask Mask */
#define QSPI_IMR_CSS(value)                   (QSPI_IMR_CSS_Msk & ((value) << QSPI_IMR_CSS_Pos))  
#define QSPI_IMR_INSTRE_Pos                   _U_(10)                                              /**< (QSPI_IMR) Instruction End Interrupt Mask Position */
#define QSPI_IMR_INSTRE_Msk                   (_U_(0x1) << QSPI_IMR_INSTRE_Pos)                    /**< (QSPI_IMR) Instruction End Interrupt Mask Mask */
#define QSPI_IMR_INSTRE(value)                (QSPI_IMR_INSTRE_Msk & ((value) << QSPI_IMR_INSTRE_Pos))
#define QSPI_IMR_Msk                          _U_(0x0000070F)                                      /**< (QSPI_IMR) Register Mask  */


